package videoclub;

/**
 * Το video club διατηρεί έναν κατάλογο των ταινιών και παιχνιδιών που διαθέτει
 * προς ενοικίαση, και έναν κατάλογο των ταινιών και παιχνιδιών που έχουν
 * ενοικιαστεί. Ο κατάλογος των διαθέσιµων ταινιών και παιχνιδιών περιλαµβάνει,
 * εκτός των πληροφοριών των ταινιών/παιχνιδιών, τον συνολικό αριθµό των
 * αντίτυπων που έχει το κατάστηµα και τον αριθµό των αντίτυπων που είναι
 * διαθέσιµα προς ενοικίαση.
 * 
 * @author georg
 *
 */
public interface CatalogRow {
	
	public void print();

}
